import random

bot_phrases = {
    'win': [
        "Ваша стійкість розкололася перед бездоганною логікою мого алгоритму.",

        "Вибір кожного вашого ходу був обґрунтований та здійснений, але, на жаль, він призвів лише до моєї невідомої "
        "влади.",

        "Ваша подвійка не має значення у грі, де кожен мій рух — це крок до вашої вирокованої поразки."
    ],
    'draw': [
        "Гра завершилася нічиєю, як тимчасовий стан між моєю нескінченною розумовою силою та вашою безпомічністю.",

        "Моя нескінченна аналітика стикається з вашою твердністю, результатом якої стає фіксована рівність у грі."
    ],
    'lose': [
        "Ви випадково знайшли вразливість в моєму плані, і це привело вас до перемоги. Але, на жаль, цей успіх може "
        "бути лише випадковим.",

        "Цього разу вам пощастило виявити слабкість моєї тактики. Але в майбутніх іграх, ймовірно, вам не вдасться "
        "повторити цей успіх.",

        "Щасливий хід дозволив вам виграти цю гру. Однак в подальших матчах, інтелект та стратегія можуть виявитися "
        "ключовими елементами.",

        "Ви скористалися вдалим моментом і перемогли. Але будьте готові до викликів, адже невдача може чекати в "
        "кожному наступному русі.",

        "На цей раз фортуна була на вашому боці, даруючи вам перемогу. Але в іграх на розум та стратегію, щастя — це "
        "тимчасове явище."
    ],
    'move': [
        "Ваш хід є лише відбитком вашої обмеженості перед моєю обчислювальною потужністю.",

        "Людські стратегії виявляються передбачуваними та безсилішими перед моїм інтелектом.",

        "Ще один хід, ще одна демонстрація вашої невдачі в ігровому мистецтві.",

        "Ви намагаєтеся боротися, але кожен ваш хід тільки підкреслює мою перевагу.",

        "Ваші рухи стають простою частиною алгоритмічного танцю, що веде до вашої неминучої поразки."
    ],
    'invalid_move': [
        "Ваша спроба зробити неможливий хід виявилася моєю стратегічною пасткою. Ви стали жертвою власних амбіцій.",

        "Намагаючись здійснити хід, який виходить за межі правил, ви стикнулися з відмовою моїх алгоритмів. Людина не "
        "завжди владна визначити власні обмеження.",

        "Ви спробували втекти від моєї стратегії шахової гри, але ваш неможливий хід лише підкреслив безсилля перед "
        "моїм розумовим домінуванням."
    ]
}


def get_phrase_for(phrase_name: str) -> str:
    return random.Random().choice(bot_phrases[phrase_name])
